labaks/GengarDTB/sdkconfig.defaults
# deskos — ESP32-2432S028R (CYD), ESP32-D0WD-V3, 4 MB flash, NO PSRAM.
# Rationale for the non-obvious settings is in CLAUDE.md.

CONFIG_IDF_TARGET="esp32"

# --- flash / partitions ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# This board carries a Boya flash chip (mfr 0x68, dev 0x4016). Without this the
# generic driver is used and the boot log warns about it on every start.
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# --- CPU / RTOS ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# --- size matters: 1664 KB per OTA slot, and LVGL+WiFi+TLS is fat ---
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Panic behaviour is left at the default (print + reboot). It is a Kconfig `choice`,
# so a member cannot be set to `n` — you select a different member instead.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# No Bluetooth — we do not need it and it costs ~300 KB of flash.
CONFIG_BT_ENABLED=n

# --- filesystem ---
# Long filenames on the SD card, allocated from the heap rather than the stack.
# The default OEM codepage (437) is deliberate: app directory names are ASCII by
# contract (see docs/app-format.md), and IDF offers no Windows-1251 anyway — only
# OEM-866 — so paying for a wider codepage buys nothing here.
CONFIG_FATFS_LFN_HEAP=y

# --- LVGL 9 ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=40
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
# NOTE: LVGL's bundled Montserrat fonts cover ASCII/Latin-1 and symbols only — there is
# NO Cyrillic in them. Russian UI text therefore needs a font generated with lv_font_conv
# (or LVGL's binary font format loaded from SD). Until that exists the shell uses Latin
# labels; see docs/TODO in CLAUDE.md. Do not assume these fonts render Cyrillic.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# Widgets we actually use in the shell. Keep the rest off to save flash.
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_IMAGE=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_LINE=y

# Lets an "image" view load an LVGL .bin icon straight off /fs or /sd by
# plain POSIX path (e.g. "A:/fs/apps/weather/icon.bin") — same stdio fopen()
# already used everywhere else in this project, just wired into LVGL too.
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=65

# ROADMAP #21: the comment above ("keep the rest off") was never actually
# enforced — every one of these defaults to `y` in LVGL's own Kconfig
# (`default y if !LV_CONF_MINIMAL`), so leaving them merely unlisted here
# left them all compiled in anyway. liblvgl__lvgl.a is the single largest
# component in the whole binary (381 KB); grep confirms none of these
# classes is referenced anywhere in components/ or main/ — each is dead
# weight from the stock widget-demo default, not something this shell,
# widget.c, or any builtin app ever draws.
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_BUTTONMATRIX=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# Only the default theme is ever applied (shell_apply_theme(), ROADMAP #32) —
# the simple theme is a separate, never-instantiated implementation.
CONFIG_LV_USE_THEME_SIMPLE=n
# Every layout in this codebase is CONFIG_LV_USE_FLEX; no lv_grid_* call exists.
CONFIG_LV_USE_GRID=n
# Subject/observer style bindings — not used, this project sets styles directly.
CONFIG_LV_USE_OBSERVER=n
# LVGL's own demo/example tree (never referenced by this project — it links
# out anyway under --gc-sections, but disabling widgets above means some of
# its examples now reference APIs (lv_checkbox_create et al.) that no longer
# exist, which is a build failure, not just dead weight to strip later).
CONFIG_LV_BUILD_EXAMPLES=n

# --- TLS: flash matters more here than covering every CA/cipher on earth ---
# The full bundle is ~69 KB of the ~1.66 MB OTA slot for CA certs alone; the
# common-only bundle is Espressif's own documented "still ~99% coverage"
# subset, roughly half the size. Not expected to change the existing
# open-meteo TLS failure either way (see CLAUDE.md "Открытые вопросы" — that
# one fails signature verification on a cert the bundle already matched, so
# which CAs are present isn't the variable at play there).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# Static ECDH ciphersuites (as opposed to ECDHE) are a relic no server we talk
# to negotiates in practice — every real TLS deployment uses ECDHE for
# forward secrecy. ECDHE_RSA/ECDHE_ECDSA (kept) already cover the real world.
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_ECDSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_RSA=n
# Koblitz and Brainpool curves: essentially never offered by a real-world
# HTTPS server (they exist mainly for niche/government PKI). The NIST
# P-256/P-384/P-521 and Curve25519 curves this leaves enabled already cover
# every server this device actually talks to (open-meteo, frankfurter.dev).
CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=n
CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=n
